/*Лабораторная работа №6
“Шаблоны и матрица”

Реализуйте шаблонный класс для описания матриц (в частном случае, векторов). Предусмотрите 3 шаблонных параметра: тип элемента, размеры матрицы N и M (N, M <= 3)
     	В составе класса должны быть:
Базовый конструктор
Конструктор копирования
Оператор присваивания копированием
Оператор ввода и вывода
Операторы +, +=, *, *=
Оператор ++, который увеличивает все элементы матрицы на 1
Метод вычисления определителя
Метод или оператор для получения и изменения элемента матрицы по индексу
 
Продемонстрируйте работу с классом.
*/